{
    "basic_info": {
      "description_header": "Greetings",
      "description": "🙏 Welcome to my portfolio.   As a soon-to-be graduate deeply passionate about game development and AI, I'm thrilled to present my skills, experience, and projects to you. My academic journey has been an exciting time of honing my technical acumen and fostering a creative vision through rigorous coursework, independent projects, and collaborative efforts with peers. I bring advanced expertise in Unreal Engine, backed by numerous innovative projects. A noteworthy instance would be a project using Phase-Functioned Neural Networks (PFNN) for controlling animations and character movements. I also have a flair for procedural animation in Unreal Engine, demonstrating my ability to create intricate, dynamic elements within games. While my understanding of Unity and Godot is also substantial, my proficiency lies primarily with Unreal Engine. In the realm of AI, I've delved into recent advancements, including transformative technologies like ChatGPT and Stable Diffusion for image generation. To witness the power of AI in enhancing image aesthetics, I encourage you to visit my Instagram via the social links at the bottom of this page. My technical repertoire extends to multithreading, data structures and algorithms, tools programming, AR/VR in games, DirectX shaders, OpenGL, and SFML. This broad yet profound knowledge base, coupled with my enthusiasm and dedication, positions me as a robust candidate for your company. I am thrilled at the prospect of furthering my learning and growth in this rapidly evolving field. I trust that my portfolio will provide you with a glimpse into my potential as a programmer. Thank you for your time and consideration in reviewing my work.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Animal Shelter",
        "startDate": "2020",
        "description": "The most expanded application I had opportunity to work with. I've learned many technologies and my code was reviewed by awesome curator. Application handles all adoption processess and allows to store all evidence on adopting animals from animal shelter.",
        "images": [
          "images/portfolio/animal-shelter/p1.jpg",
          "images/portfolio/animal-shelter/p2.jpg"
        ],
        "youtube": "https://www.youtube.com/embed/8fWwnc0_WPo",
        "url": "",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      },
      {
        "title": "Photography",
        "startDate": "2018",
        "description": "Personal project for study subject. I was responsible for testing photography application that optimizes images with popular algorithms used by graphic editors like Pixlr or Adobe Photoshop. I've earned A grade :)",
        "images": [
          "images/portfolio/photography/p1.jpg",
          "images/portfolio/photography/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "3D Object Viewer",
        "startDate": "2015",
        "description": "One of the first apps I was working on my internship. I had to develop front-end implementation for app that shows 3D models of known buildings. This was also my first project in Angular framework. I've learned a lot!",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "DefOpenSource",
        "title": "Front-End Developer",
        "years": "10.2019 - present",
        "mainTech": [
          "Angular 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Serros Solutions",
        "title": "Intern",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }