{
    "basic_info": {
      "description_header": "Greetings",
      "description": "🙏 Welcome to my portfolio.   As a soon-to-be graduate deeply passionate about game development and AI, I'm thrilled to present my skills, experience, and projects to you. My academic journey has been an exciting time of honing my technical acumen and fostering a creative vision through rigorous coursework, independent projects, and collaborative efforts with peers. I bring advanced expertise in Unreal Engine, backed by numerous innovative projects. A noteworthy instance would be a project using Phase-Functioned Neural Networks (PFNN) for controlling animations and character movements. I also have a flair for procedural animation in Unreal Engine, demonstrating my ability to create intricate, dynamic elements within games. While my understanding of Unity and Godot is also substantial, my proficiency lies primarily with Unreal Engine. In the realm of AI, I've delved into recent advancements, including transformative technologies like ChatGPT and Stable Diffusion for image generation. To witness the power of AI in enhancing image aesthetics, I encourage you to visit my Instagram via the social links at the bottom of this page. My technical repertoire extends to multithreading, data structures and algorithms, tools programming, AR/VR in games, DirectX shaders, OpenGL, and SFML. This broad yet profound knowledge base, coupled with my enthusiasm and dedication, positions me as a robust candidate for your company. I am thrilled at the prospect of furthering my learning and growth in this rapidly evolving field. I trust that my portfolio will provide you with a glimpse into my potential as a programmer. Thank you for your time and consideration in reviewing my work.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Procedural Animation in Unreal Engine",
        "startDate": "September 2022 - January 2023",
        "description": "The project showcases a procedural animation system developed in Unreal Engine, utilizing the Control Rig system and Full Body IK node. The control rig was created with bone controllers for manipulating the gecko's feet based on external data. Feet position was calculated using line traces, allowing the gecko to step in an arc onto new positions. The Full Body IK node calculated bone positions using inverse kinematics algorithms, resulting in realistic character animations. A post-process animation blueprint enhanced believability by layering multiple animations, incorporating physical simulations, and adjusting body parts. This blueprint seamlessly blended animations to create lifelike gecko behavior. The project leverages Unreal Engine's powerful animation tools to achieve dynamic and immersive character movements",
        "images": [
          "images/portfolio/Procedural-Animation-Unreal-Engine/1.jpg",
          "images/portfolio/Procedural-Animation-Unreal-Engine/2.jpg",
          "images/portfolio/Procedural-Animation-Unreal-Engine/3.jpg"
        ],
        "youtube": "https://www.youtube.com/embed/ExgCP27vJGc",
        "technologies": [
          {
            "class": "devicon-maya-plain",
            "name": "Maya"
          },
          {
            "class": "devicon-unrealengine-plain",
            "name": "Unreal Engine"
          },
          {
            "class": "devicon-cplusplus-plain",
            "name": "C++"
          }
        ]
      },
      {
        "title": "Gek-Go",
        "startDate": "September 2021 - May 2022",
        "description": "A DES310 group project, mentored by Rockstar. I worked as the engine and tools programmer for this project, developing the initial traversal mechanic for the beta build. After that I went on to work on the water shader, skybox, butterfly particle effects, animations in unreal engine, and inverse kinematics.",
        "images": [
          "images/portfolio/Gek-Go/GekGo.jpg",
          "images/portfolio/Gek-Go/1.jpg",
          "images/portfolio/Gek-Go/2.jpg",
          "images/portfolio/Gek-Go/3.jpg",
          "images/portfolio/Gek-Go/4.jpg"
        ],
        "youtube": "https://www.youtube.com/embed/AFXZTwJwWyM",
        "technologies": [
          {
            "class": "devicon-maya-plain",
            "name": "Maya"
          },
          {
            "class": "devicon-unrealengine-plain",
            "name": "Unreal Engine"
          },
          {
            "class": "devicon-cplusplus-plain",
            "name": "C++"
          }
        ]
      },
      {
        "title": "DirectX Shaders",
        "startDate": "September 2021 - January 2022",
        "description": "A CMP301 project, uses D3D11 Shaders to render a scene from the cult anime Neon-Genesis Evangelion. Gerstner Wave Equation is used for water simulations. Bloom is applied to both the light sources in the scene including the water.",
        "images": [
          "images/portfolio/DirectX-Shaders/NGE.jpg",
          "images/portfolio/DirectX-Shaders/1.jpg",
          "images/portfolio/DirectX-Shaders/2.jpg",
          "images/portfolio/DirectX-Shaders/3.jpg"
        ],
        "youtube": "https://www.youtube.com/embed/8fWwnc0_WPo",
        "url":"https://github.com/utkarshyadav009/DirectXShaders-CMP301-Coursework",
        "technologies": [
          {
            "class": "devicon-cplusplus-plain",
            "name": "C++"
          },
          {
            "class": "devicon-opengl-plain",
            "name": "D3D11"
          }
        ]
      },
      {
        "title": "Handwritten Digit-Recognition",
        "startDate": "January 2022 - March 2022",
        "description": "Handwritten digit recognition using feed forward neural network and softmax actiavtion function, It is a shallow neural network with no hidden layers. SFML library is used for GUI. The number 6 and 9 do not get recogenised properly in this version, maybe due to the limited training data provided and lack of hidden layers",
        "images": [
          "images/portfolio/handwritten-digit-recoginition/1.jpg",
          "images/portfolio/handwritten-digit-recoginition/2.jpg",
          "images/portfolio/handwritten-digit-recoginition/3.jpg",
          "images/portfolio/handwritten-digit-recoginition/4.jpg"
        ],
        "youtube": "https://www.youtube.com/embed/QLE3xwZhBds",
        "url": "https://github.com/utkarshyadav009/Digit-Recognition-CMP304-Project",
        "technologies": [
          {
            "class": "devicon-cplusplus-plain",
            "name": "C++"
          },
          {
            "class": "devicon-visualstudio-plain",
            "name": "Visual Studio"
          },
          {
            "class": "devicon-opengl-plain",
            "name": "SFML"
          }
        ]
      },
      {
        "title": "AI Patrol Mechanic Unreal Engine",
        "startDate": "September 2021 - January 2022",
        "description": "Patrol Mechanic is an Unreal Engine project showcasing AI patrol guards. Utilizing behavior trees and task nodes, the guards are programmed to protect predefined paths. They employ sight and hearing senses to detect and respond to the player's presence, initiating a chase if spotted. The project highlights the implementation of multiple AI guards to enhance security and create engaging gameplay scenarios.",
        "images": [
          "images/portfolio/Patrol-Mechanic-UnrealEngine/1.jpg",
          "images/portfolio/Patrol-Mechanic-UnrealEngine/2.jpg",
          "images/portfolio/Patrol-Mechanic-UnrealEngine/3.jpg"
        ],
        "youtube": "https://www.youtube.com/embed/Y-ux4XKcIb8",
        "technologies": [
          {
            "class": "devicon-cplusplus-plain",
            "name": "C++"
          },
          {
            "class": "devicon-visualstudio-plain",
            "name": "Visual Studio"
          },
          {
            "class": "devicon-unrealengine-plain",
            "name": "Unreal Engine"
          }
        ]
      },
      {
        "title": "OpenGL Graveyard Scene",
        "startDate": "September 2020 - January 2021",
        "description": "Graveyard Scene is an OpenGL project that immerses you in a hauntingly beautiful graveyard setting. It features a spooky tree, eerie tombstones, and a captivating cottage at the scene's center. The project demonstrates various techniques such as reflection, lighting, and procedural cylinder generation for a well. Additionally, it incorporates object loading and showcases a dynamic day and night cycle, adding depth and realism to the atmospheric experience.",
        "images": [
          "images/portfolio/OpenGL-Graveyard-Scene/1.jpg",
          "images/portfolio/OpenGL-Graveyard-Scene/2.jpg",
          "images/portfolio/OpenGL-Graveyard-Scene/3.jpg"
        ],
        "youtube": "https://www.youtube.com/embed/Q9DvS-QiNL8",
        "technologies": [
          {
            "class": "devicon-cplusplus-plain",
            "name": "C++"
          },
          {
            "class": "devicon-visualstudio-plain",
            "name": "Visual Studio"
          },
          {
            "class": "devicon-opengl-plain",
            "name": "OpenGL"
          }
        ]
      },
      {
        "title": "Loopy Trajectory",
        "startDate": "October 2019 - October 2019",
        "description": "Loopy Trajectory is a thrilling game jam creation, with the theme of revolution in mind, it is reminiscent of the sensation 'Getting Over It.' Developed in Unity, the game follows the captivating story of Bob, a stranded spaceship pilot trapped in interstellar space. Players embark on an epic journey, maneuvering through challenging levels by utilizing wormholes to reach home. With an engaging storyline and narrative crafted by me, the game immerses players in Bob's extraordinary quest. The evocative audio design, featuring a narrator delivering memorable quotes like 'Don't hate the player, hate the game,' adds an extra layer of depth to this gripping experience.",
        "images": [
          "images/portfolio/Loopy-Trajectory/1.jpg",
          "images/portfolio/Loopy-Trajectory/2.jpg",
          "images/portfolio/Loopy-Trajectory/3.jpg"
        ],
        "youtube": "https://www.youtube.com/embed/wxJP_Qw7JgY",
        "url":"https://snarmph.itch.io/loopy-trajectory",
        "technologies": [
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          },
          {
            "class": "devicon-unity-original",
            "name": "Unity"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "DefOpenSource",
        "title": "Front-End Developer",
        "years": "10.2019 - present",
        "mainTech": [
          "Angular 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Serros Solutions",
        "title": "Intern",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }